benchmark/ssl-nginx/res/test-log-kernel-1.txt
Running 10s test @ https://127.0.0.1:4043/index.html
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    76.50ms   41.69ms 529.35ms   91.75%
    Req/Sec     1.48k   607.30     3.49k    72.68%
  55869 requests in 10.06s, 14.65MB read
Requests/sec:   5554.53
Transfer/sec:      1.46MB
Running 10s test @ https://127.0.0.1:4043/data/example1k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.41ms   19.07ms  94.97ms   59.47%
    Req/Sec     1.60k     1.37k    6.94k    85.26%
  60608 requests in 10.07s, 74.16MB read
Requests/sec:   6019.23
Transfer/sec:      7.36MB
Running 10s test @ https://127.0.0.1:4043/data/example2k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.95ms   17.46ms 128.41ms   74.53%
    Req/Sec     1.55k     1.03k    5.57k    63.75%
  60382 requests in 10.09s, 132.68MB read
Requests/sec:   5986.03
Transfer/sec:     13.15MB
Running 10s test @ https://127.0.0.1:4043/data/example4k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    38.39ms   17.50ms 106.15ms   71.33%
    Req/Sec     1.55k     0.90k    5.27k    74.17%
  60573 requests in 10.08s, 251.11MB read
Requests/sec:   6007.88
Transfer/sec:     24.91MB
Running 10s test @ https://127.0.0.1:4043/data/example16k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    55.99ms   23.35ms 107.29ms   58.27%
    Req/Sec     0.86k     0.93k    4.51k    83.64%
  32425 requests in 10.08s, 513.37MB read
Requests/sec:   3215.43
Transfer/sec:     50.91MB
Running 10s test @ https://127.0.0.1:4043/data/example128k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    68.36ms   25.38ms 127.31ms   63.09%
    Req/Sec   493.41    163.33     1.13k    67.38%
  18507 requests in 10.10s, 2.26GB read
Requests/sec:   1832.99
Transfer/sec:    228.95MB
Running 10s test @ https://127.0.0.1:4043/data/example256k.txt
  4 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    78.43ms   27.27ms 177.75ms   71.60%
    Req/Sec   366.25    173.97   848.00     71.82%
  13500 requests in 10.08s, 3.29GB read
Requests/sec:   1339.30
Transfer/sec:    334.22MB